import streamlit as st
"""
# 1.前言

社会工程学中的内容很多都是基于社会学、心理学等相关的内容，所以在学习和利用的时候我们常常会陷入一些思考：

学习社会工程学的意义是什么？

很多“非社会工程学”的社会组织行为也会提到相关内容，我们该如何看待？

我们该抱着怎样的态度才算是“正确地”学习社会工程学？

# 2.学习社会工程学的意义是什么？

我们学习社会工程学从最基础的意义上来说就是帮助我们通过社交行为的手段解决我们所遇到的社会问题，这是最基础也是最容易理解的，但是我们有时候也会思考，学习社会工程学对我们人生的意义何在？控制和了解他人及社会能对我们的自我价值实现有什么具体的帮助？这个帮助在我们的价值观念中是否是合情合理的？以下观点仅为我个人思考：

### 对于人生的意义：

每个人都有每个人的人生追求和终极目的，我的人生追求就是阅览人间百态。所以对我而言学习社会工程学就是能够提高我对于社会定义上的人的观察和理解，并思考出人和人之间交互的底层的逻辑，并推导出在各个不同环境和演变下的社会的一些规律。这对我而言满足我的自我实现的需要，能让我达到我的目的。所以，学习社会工程学对于每个人的人生意义都不相同，每个人都有自己的学习的理由和属于自己的收获。

### 控制和了解他人及社会能对我们的自我价值实现有什么具体的帮助：

在社会生活中，我们会产生很多社会行为，这些社会行为又会为不同的目标带来不同的社会影响。我们学会这些东西是为了帮助自己提升个人价值，但是在这个价值之上还有一个就是遵循你所认为的这个社会的普世价值。什么是普世价值？就是社会上的大部分群体所认可的价值。所以在我们学习社会工程学和利用社会工程学的时候我们一定要遵循这个规律，不能将我们所学的知识或者技巧用于一些不符合社会普世价值的社会行为上。

人是具有社会性的动物，在我的观念中，人所产生的所有社会行为最终只有一个目的那就是实现自己的社会价值，这种社会价值可以是很多表现方面，比如物质财富带来的社会认可，或者社交关系中的社会认可等等。所以我认为学习社会工程学带来的具体帮助就是能让我们更有效率地去实现我们的自我价值。

# 3.很多“非社会工程学”的社会组织行为也会提到相关内容，我们该如何看待？

由于社会工程学这门学科所具有的控制和侵犯的作用，我们在生活中也会看到很多“非社会工程学”的社会组织行为，比如传销课程、pua课程等非法的社会组织行为，每个人看待的观点不同，我也仅仅是作为我个人的观点做一些简单的表达：

首先，社会工程学是由具体的应用场景的，这门学科不能完全脱离于我们所处的具体环境来单独研究，所以对于这种传销课程或者PUA课程的“从场景出发的研究方向”是我们在学习社会工程学的时候需要学习和借鉴的地方。

但是，我们还是应该时刻提醒自己，社会认可和社会价值的来源是来自于社会的普世价值的实现和评判，所以我们不管是在学习还是在使用的过程中一定要提醒自己不能够违反或者脱离社会的基本价值，最具体的表现就是不能够违背法律的规范。这很重要，我们作为社工的攻击者的时候不管是分析事件还是分析目标都要将我们攻击者也要带入到这个社会环境中来，所以我们一定要遵守法律的规范和社会的基本道德观念。

# 4.我们该抱着怎样的态度才算是“正确地”学习社会工程学？

## 对于任何知识都要抱有敬畏之心

对于任何知识，不管是社会工程学还是网络安全或者是其他知识，我个人的态度一向是抱有敬畏之心。如果一个人在学习某个知识的时候没有这个态度，那么学习的过程中就会轻视很多东西，用错很多东西，最后导致自己走向歧路。尊重知识本身的客观规律，尊重知识中的事物的客观规律是我们学习任何一门知识的最基础的态度。

## 社会工程学是用来帮助我们实现社会价值的，不是用来背离或者逃脱社会评判的

学习社会工程学，我们的最终目的是帮助我们解决社会问题，实现社会价值。不管是学习或者使用社会工程学的哪一个部分我们都要想到这一点。我们作为人，其历史演进中所带来的社会属性是我们任何人都无法逃脱的，这是作为一个社会定义的人的局限性，我们要清楚地认识到这一点。

## 不要走火入魔，保持本心

社会工程学在我们的生活中很实用，这是客观事实，但是我们也要知道，具体的应用场景由具体的分析方法，我们不能够什么场景，什么时候都去用社会工程学的方法去思考。我个人认为，人的价值除了社会的评价价值之外，还有人的自我评价价值，要实现这个价值，最重要的就是保持本心，保持本性，让自己是原来的自己才，又能在这个基础上去了解社会、他人和社会定义上的自己，这才算是“真正”学好了社会工程学。
"""